{"During what month do people sleep the least? ": "February", "He has married many women, but has never been married. Who is he? ": "Priest", "I am light as a feather, yet the strongest man can't hold me for more than 5 minutes. What am I? ": "Breath", "I am very easy to get into, but it is hard to get out of me.  What am I?": "Trouble", "I am round at the ends and high in the middle.  What am I?": "Ohio", "What tastes better than it smells? ": "tongue", "What is brown and sticky?": "stick", "What asks but never answers?": "owl", "What can be swallowed, but can swallow you? ": "Pride", "What goes in the water black and comes out red? ": "lobster", "What loses its head in the morning and gets it back at night?": "pillow", "What can you catch but not throw? ": "cold", "What kind of room has no doors or windows? ": "Mushroom", "What is made of wood but can't be sawed? ": "Sawdust", "What is orange and sounds like a parrot? ": "Carrot", "What jumps higher than a building? ": "Everything", "What has 3 feet but cannot walk? ": "yardstick", "What has a single eye but cannot see? ": "needle", "What goes up and never comes down? ": "age", "What has 4 fingers and a thumb, but is not living? ": "glove", "What starts with an e but only has a single letter in it? ": "Envelope", "What is so delicate that even mentioning it breaks it? ": "Silence", "What building has the most stories? ": "Library", "What number do you get when you multiply all of the numbers on a telephone's number pad? ": "0", "What heavy seven letter word can you take two away from and be left with eight? ": "Weights", "Which side of a cat has the most fur? ": "Outside", "What has ten letters and starts with gas? ": "Automobile", "We hurt without moving.  We poison without touching. We bear the truth and the lies. We are not to be judged by our size.  What are we? ": "Words", "I take what you receive and surrender it all by waving my flag.  What am I?": "Mailbox", "What can one not keep, two hold, and three destroy?": "Secret", "What am I?": "Question", "I can bring tears to your eyes; resurrect the dead, make you smile, and reverse time.  I form in an instant but I last a life time.  What am I?": "Memory", "Give me food, and I will live. Give me water, and I will die. What am I?": "Fire", "I am the beginning of the end, the end of every place. I am the beginning of eternity, the end of time and space. What am I?": "E", "You use a knife to slice my head and weep beside me when I am dead.  What am I?": "Onion", "There is an ancient invention still used in some parts of the world today that allows people to see through walls.What is it?": "Window", "100 feet in the air, yet its back is on the ground.  What is it?": "Centipede", "You may enter, but you may not come in, I have space, but no room, I have keys, but open no lock. What am I?": "Computer", "Timmy's mother has three children. The first was named April. The next was named May.": "Timmy", "What flies when it's born, lies when it's alive, and runs when it's dead?": "Snowflake", "What is the heart of many risks, has a heart, but is not a living being?": "Cards", "Never falling, often moving. Untouchable, but sometimes deadly. Another danger signalling, often seen but never staying. What am I?": "Smoke", "What begins to die on a wedding day?": "Flowers", "Who lives in a house with one bedroom, 50 hallways, and ghosts lurking everywhere?": "Pacman", "What freezes after it is heated up?": "computer", "I watch over you as you sleep without leaving a trace. It only takes one small step to land on my face. What am I?": "moon", "I have a birthplace but was never born. I have a mouth but can't speak and I run but have no legs. What am I?": "river", "At a bank without money I’d go on a spree. The more I like you, the more you hate me. What am I?": "mosquito", "Like a clock, I strike but at no specific time and after this follows a delayed aggressive chime. With my movements, you may say I’m precise as I don’t like to go to the same place twice. What am I?": "lightning", "I can ruin your day, or darken your life. And while I'm expected, I'm never alright. I'm bad for business, and worse for your hair. Wherever I am, there's something not there. What am i?": "loss", "If Mississippi should lend Missouri her New Jersey, what would Delaware?": "Alaska", "Raise me none, and I'm unbeaten. Raise me once, I am as well. Raise me thrice, and I am eaten. All said right, but wrongly spelled. Who am I?": "two", "Remove 'Y' and you do this with apparel. Remove 'E' and I am cautious.": "weary", "I'm smaller than a mouse, but I can fill a whole house. What am I?": "snail", "Pair me with baking, I turn from colored to white, I'm dirt cheap; in stores and restaurants I abound. When I use my alias I can make quite a noise, Or in music, a much more well-liked sound.": "soda", "I am everyone, yet no-one, I can be anywhere or nowhere, when the lights go out I disappear and when I face myself we multiply. What am I?": "reflection", "I have lots of teeth but can't chew a thing. What am I?": "comb", "What word, if spelled right is wrong and spelled wrong is right?": "wrong", "You move your arm, I do it back. You move your leg, I do it back. You close your eyes, but I can't do it. Who am I?": "shadow", "What is the capital of Greece?": "G", "You bury me when I am alive, and dig me up when I die. What am I?": "Plant", "Take me for a spin and I'll make you cool, but use me in the winter and you're fool. What am I?": "Fan", "What is the difference between yesterday and tomorrow?": "Today", "I repeat only the last word you say. The more I repeat, the softer I get. I cannot be seen but can be heard. What am I?": "Echo", "Add a T and I shoot through the sky. Then add an S and I multiply. What word is it?": "Come", "One way I'm loose, one way I'm tight. Out with left, in with right. What am I?": "Screw"}